InformationRegisters/ГрафикиПриема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиПриема</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поликлиника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поликлиники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Врачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кабинет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кабинеты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Прием.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Прием</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пациент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пациенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поликлиника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поликлиники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кабинет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кабинеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Врачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПожеланиеНаПрием.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПожеланиеНаПрием</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пациент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пациенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поликлиника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поликлиники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Врачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПациентОповещенОВозможностиЗаписиНаПрием</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/РаботаСЗаписьюНаПрием/Ext/Module.bsl
// 

Функция ЗаписатьНаПрием(Пациент, ДатаПриема, Врач, Поликлиника, Кабинет) Экспорт
	
	НачатьТранзакцию();
	
	Прием = Документы.Прием.СоздатьДокумент();
	Прием.Дата = ТекущаяДата();
	Прием.Пациент = Пациент;
	Прием.Поликлиника = Поликлиника;
	Прием.ДатаПриема = ДатаПриема;
	Прием.Врач = Врач;
	Прием.Кабинет = Кабинет;
	Прием.Записать(РежимЗаписиДокумента.Проведение);
	
	ЗаписьГрафика = РегистрыСведений.ГрафикиПриема.СоздатьМенеджерЗаписи();
	ЗаписьГрафика.Поликлиника = Поликлиника;
	ЗаписьГрафика.Врач = Врач;
	Если ЗначениеЗаполнено(Кабинет) Тогда
		ЗаписьГрафика.Кабинет = Кабинет;
	КонецЕсли; 
	ЗаписьГрафика.Дата = НачалоДня(ДатаПриема);
	ЗаписьГрафика.Время = ДатаПриема; // Предполагаю что время скопируется
	ЗаписьГрафика.Прочитать();
	Если Не ЗаписьГрафика.Выбран() Тогда
		ВызватьИсключение "Запись на прием с указанными параметрами невозможна";
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗаписьГрафика.Прием) Тогда
		ВызватьИсключение "Запись на прием с указанными параметрами уже занята";
	КонецЕсли;
	ЗаписьГрафика.Прием = Прием.Ссылка;
	ЗаписьГрафика.Записать();
		
	ЗафиксироватьТранзакцию();
	
	Возврат Прием.Ссылка;
	
КонецФункции

Функция  СоздатьПожеланиеНаПрием(Пациент, Врач, Поликлиника) Экспорт
	
	ПожеланиеНаПрием = Документы.ПожеланиеНаПрием.СоздатьДокумент();
	ПожеланиеНаПрием.Пациент = Пациент;
	ПожеланиеНаПрием.Поликлиника = Поликлиника;
	ПожеланиеНаПрием.Врач = Врач;
	ПожеланиеНаПрием.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ПожеланиеНаПрием.Ссылка;
	
КонецФункции

Функция ПолучитьСписокСпециализаций() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Специализации.Ссылка КАК Специализация
	               |ИЗ
	               |	Справочник.Специализации КАК Специализации
	               |ГДЕ
	               |	НЕ Специализации.ПометкаУдаления";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Специализация");
	
КонецФункции
